In [1]:
import pandas as pd

In [3]:
aiseles = pd.read_csv("datasets/aisles.csv")

In [4]:
aiseles.shape

(134, 2)

In [5]:
aiseles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [6]:
departments = pd.read_csv("datasets/departments.csv")

In [7]:
departments.shape

(21, 2)

In [8]:
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [9]:
order_products_prior = pd.read_csv("datasets/order_products__prior.csv")

In [10]:
order_products_prior.shape

(32434489, 4)

In [11]:
order_products_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [15]:
order_products_train  = pd.read_csv("datasets/order_products__train.csv")
order_products_train.shape

(1384617, 4)

In [16]:
order_products_train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [23]:
len(order_products_train["order_id"].unique())

131209

In [2]:
orders  = pd.read_csv("datasets/orders.csv")
orders.shape

(3421083, 7)

In [3]:
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [4]:
orders.columns

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [5]:
orders["eval_set"].unique()

array(['prior', 'train', 'test'], dtype=object)

In [17]:
products = pd.read_csv("datasets/products.csv")
products.shape

(49688, 4)

In [18]:
products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [20]:
sample_submission  = pd.read_csv("datasets/sample_submission.csv")
sample_submission.head(100)

    order_id     products
0         17  39276 29259
1         34  39276 29259
2        137  39276 29259
3        182  39276 29259
4        257  39276 29259
..       ...          ...
95      5109  39276 29259
96      5128  39276 29259
97      5166  39276 29259
98      5216  39276 29259
99      5349  39276 29259

[100 rows x 2 columns]